#include <stdio.h>
#include <locale.h>

int main(void) {
	setlocale(LC_ALL, "Rus");
	int n, ost;
	char test[][16] = { "", "Одно ", "Два ", "Три ", "Четыре ", "Пять ", "Шесть ", "Семь ", "Восемь ", "Девять " };
	char slov[][21] = {"Учебных заданий", "Учебное задание", "Учебных Задания", "Учебных Задания", "Учебных Задания", "Учебных заданий", "Учебных заданий" , "Учебных заданий" ,"Учебных заданий" ,"Учебных заданий" };
	char chis[][13] = {" ", "Десять", "Одиннадцать", "Двенадцать", "Тринадцать", "Четырнадцать", "Пятнадцать", "Шестнадцать", "Семнадцать", "Восемнадцать", "Девятнадцать", "Двадцать" };
	char des[][10] = {"Двадцать ", "Тридцать ", "Сорок "};
	printf("Введите количество заданий\n");
	scanf_s("%i", &n);
	if ((n>9) && (n<21)) {
		n = n - 9;
		printf("%s ", chis[n]);
		printf("%s", slov[0]);
	}
	else {
		ost = (float)n / 10;
		printf("%s", des[ost - 2]);
		ost = n % 10;
		if (n != 0) {
			printf("%s", test[ost]);
		}
		printf("%s", slov[ost]);
	}
	return 0;
}
