#include <locale.h>
#include <stdio.h>
int main(void) {
	setlocale(LC_ALL, "Rus");
	char c1[][8] = { "зелЄной", "красной", "желтой", "белой", "черной" };
	char c2[][9] = {"зелЄного", "красного", "желтого", "белого", "черного"};
	char j[][9] = { "крысы", "коровы", "тигра", "зайца", "дракона", "змеи", "лошади", "овцы", "обезь€ны", "курицы", "собаки", "свиньи" };
	int n,a,b;
	printf("¬ведите номер года\n");
	scanf_s("%i", &n);
	n = n - 4;
	n = n % 60;
	a = n%12;
	b = n / 12;
	if ((1 < a) && (a < 5)) {
		printf("год %s %s", c2[b], j[a]);
	}
	else {
		printf("год %s %s", c1[b], j[a]);
	}
	return 0;
}