#include <stdio.h>
#include <locale.h>
int main(void) {
    setlocale(LC_ALL, "Rus");
    int a, b;
    char mes[12][20] = {"Января", "Февраля", "Марта", "Апреля", "Мая",
      "Июня", "Июля", "Августа", "Сентября","Октября",
      "Ноября", "Декабря" };
    char den[31][20] = { "Первое", "Второе", "Третье", "Четвёртое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одиннадцатое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое", "Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать четрвёртое", "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тридцатое", "Тридцать первое" };
    printf("Введите номер дня и месяца\n");
    scanf_s("%i %i", &a, &b);
    a = a - 1;
    b = b - 1;
    printf("%s %s", den[a], mes[b]);
    return 0;
}
